Tekla.Structures.Model.ReferenceModel.#ctor
Initializes a new instance of the Tekla.Structures.Model.ReferenceModel class.
The default values are as follows:
Filename = string.Empty;
ActiveFilePath = string.Empty;
ProjectGUID = Guid.Empty;
ModelGUID = Guid.Empty;
VersionGUID = Guid.Empty;
Position = new Point();
Scale = 1.0;
Visibility = VisibilityEnum.VISIBLE;